#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_lightsail_static_ip.vita_db_ip: Refreshing state... [id=vita_db_ip]
aws_lightsail_key_pair.vita_db_key: Refreshing state... [id=vita_db_key]
aws_lightsail_instance.vita_db: Refreshing state... [id=mongo-enterprise]
local_sensitive_file.private_key: Refreshing state... [id=5c2c7f72507f28d9254f7d23bed4dafc42520c8d]
aws_lightsail_static_ip_attachment.vita_db_ip_attach: Refreshing state... [id=vita_db_ip]
aws_lightsail_instance_public_ports.vita_db_ports: Refreshing state... [id=mongo-enterprise-568155360]
local_file.ansible_inventory: Refreshing state... [id=17f58a7d6deb541465a2e41c16c913016a9400be]
null_resource.lightsail_provisioner: Refreshing state... [id=5920616226717667760]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lightsail_instance_public_ports.vita_db_ports must be replaced
-/+ resource "aws_lightsail_instance_public_ports" "vita_db_ports" {
      ~ id            = "mongo-enterprise-568155360" -> (known after apply)
        # (1 unchanged attribute hidden)

      - port_info { # forces replacement
          - cidrs      = [
              - "0.0.0.0/0",
            ] -> null
          - from_port  = 22 -> null
          - ipv6_cidrs = [
              - "::/0",
            ] -> null
          - protocol   = "tcp" -> null
          - to_port    = 22 -> null
        }
      - port_info { # forces replacement
          - cidrs      = [
              - "0.0.0.0/0",
            ] -> null
          - from_port  = 27017 -> null
          - ipv6_cidrs = [
              - "::/0",
            ] -> null
          - protocol   = "tcp" -> null
          - to_port    = 27019 -> null
        }
      + port_info { # forces replacement
          + cidrs      = (known after apply)
          + from_port  = 22
          + ipv6_cidrs = (known after apply)
          + protocol   = "tcp"
          + to_port    = 22
        }
      + port_info { # forces replacement
          + cidrs      = (known after apply)
          + from_port  = 27017
          + ipv6_cidrs = (known after apply)
          + protocol   = "tcp"
          + to_port    = 27019
        }
    }

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = <<-EOT
            [mongo-enterprise]
            52.76.220.106
            [mongo-enterprise:vars]
            ansible_ssh_common_args='-o StrictHostKeyChecking=accept-new'
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./provisioning/inventory"
      + id                   = (known after apply)
    }

  # local_sensitive_file.private_key will be created
  + resource "local_sensitive_file" "private_key" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "./private.key"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @STommydx, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Dev`*